diary/201607/1.org
#+TITLE:关于代码整洁
#+AUTHOR:ALIANG
#+EMAIL:anbgsl1110@gmail.com
#+KEYWORDS:DIARY
【aliang diary】-青春无限可能，拎得清，爱生活，爱自己
** INFO
日期：2016-07-12；作者：阿亮；关键字：笔记、编码规范

代码整洁之道的学习笔记

一直记得代码整洁之道中让很多人都认可的一句话，稍后等于永不（Later equals never）
** 命名
做有意义的命名

类名和对象名称应该是名称或者动名词，不是动词。方法应该是动词或者动词短语。

名称是可读，可搜索，减少前缀

采用问题领域的或者技术性强的词汇

为方便后续的维护，一旦发现更好的命名，立马换掉
** 注释
减少对标题栏进行注释

尽量不要把代码直接注释掉，别人看不懂，不要那样做

** 代码格式
尽量保证代码行短小

空行代表代码的关联性，规范tab和空格

确定整个项文档的编码
** null处理

返回null只是给调试增加麻烦，尽量别这样做
** 对象和方法
做小规模的抽象，做少的重复。

代码尽量少，三五行最好，注释都不用去写

参数尽量要少，最好没有，不要超过三个

DRY原则-don't repeat yourself(不做重复的自己)

** 经典语句
命名良好，代码短小，良好的组织结构，目的让系统变得完美。

整洁的代码只做好一件事，讲事实，避免猜测。
